In [1]:
import pandas as pd

In [27]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
print(df.columns.values)

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

In [68]:
inputs = df
inputs = inputs.drop('Survived',axis='columns')
inputs = inputs.drop('PassengerId',axis='columns')
inputs = inputs.drop('Name',axis='columns')
inputs = inputs.drop('SibSp',axis='columns')
inputs = inputs.drop('Parch',axis='columns')
inputs = inputs.drop('Ticket',axis='columns')
inputs = inputs.drop('Cabin',axis='columns')
inputs = inputs.drop('Embarked',axis='columns')

In [69]:
print(inputs.columns.values)

['Pclass' 'Sex' 'Age' 'Fare']

In [70]:
target = df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [71]:
sz = len(inputs['Fare'])
print(sz)

for i in range(sz):
    inputs['Fare'][i] = int(inputs['Fare'][i])

inputs.head()

891

   Pclass     Sex   Age  Fare
0       3    male  22.0   7.0
1       1  female  38.0  71.0
2       3  female  26.0   7.0
3       1  female  35.0  53.0
4       3    male  35.0   8.0

In [72]:
from sklearn.preprocessing import LabelEncoder

In [73]:
le_pClass = LabelEncoder()
le_sex = LabelEncoder()
le_age = LabelEncoder()
le_fare = LabelEncoder()

In [74]:
inputs['pClass_n'] = le_pClass.fit_transform(inputs['Pclass'])
inputs['sex_n'] = le_sex.fit_transform(inputs['Sex'])
inputs['age_n'] = le_age.fit_transform(inputs['Age'])
inputs['fare_n'] = le_fare.fit_transform(inputs['Fare'])

In [75]:
inputs.head()

   Pclass     Sex   Age  Fare  pClass_n  sex_n  age_n  fare_n
0       3    male  22.0   7.0         2      1     28       4
1       1  female  38.0  71.0         0      0     51      56
2       3  female  26.0   7.0         2      0     34       4
3       1  female  35.0  53.0         0      0     47      46
4       3    male  35.0   8.0         2      1     47       5

In [76]:
inputs_n = inputs.drop(['Sex', 'Pclass', 'Fare','Age'],axis='columns')
inputs_n.head()

   pClass_n  sex_n  age_n  fare_n
0         2      1     28       4
1         0      0     51      56
2         2      0     34       4
3         0      0     47      46
4         2      1     47       5

In [77]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [78]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [79]:
model.score(inputs_n,target)

0.9696969696969697

In [80]:
model.predict([[2,1,47,5]])

array([0])

In [81]:
target[4]

0